{
  "validate_heading" : "Validate",
  "appscreen_validator_major" : "Validate Resources",
  "appscreen_validator_minor" : "Manually enter, or upload resources for validation.",
  "enter_resources_heading" : "Enter Resource",
  "manual_entry_place_holder" : "Enter Resource Manually...",
  "manual_entry_title" : "Code",
  "manual_entry_error" : "Please enter something to validate.",
  "manual_entry_cannot_parse_exception" : "Cannot parse entered text as valid JSON/XML.",
  "validate_button" : "Validate",
  "upload_resources_heading" : "Upload Resources",
  "upload_files_title" : "Uploaded Files",
  "upload_button" : "Upload",
  "upload_entry_view" : "View",
  "upload_entry_delete" : "Delete",
  "options_heading" : "Options",
  "appscreen_options_major" : "Validation Options",
  "appscreen_options_minor" : "Modify setting for validating resources.",
  "options_flags_title" : "Flags",
  "options_flags_1_title" : "Native Validation (doNative)",
  "options_flags_1_description" : "By default, the validation engine only validates using the FHIR structures and profiles. The publication processes also generate a variety of xml, json and RDF schemas. You can ask the validator to validate against these as well using this option. Note that there is nothing in these schemas that is not validated directly by the engine itself anyway, so the main use for this is to see the kind of errors that would be reported from these schemas by other software.",
  "options_flags_2_title" : "Must Support (hintAboutMustSupport)",
  "options_flags_2_description" : "In some cases (e.g. when creating examples for implementation guides or when checking for potential interoperability issues with a new communication partner), it can be useful to know when data elements are present in an instance when those elements are not \"mustSupport\" in the profile(s) the instance is being validated against. Identifying situations where this occurs might drive a change to the profile or cause a designer to drop an element from the instance. In other cases, the presence of the element can be fine and the information message ignored.",
  "options_flags_3_title" : "Assume Valid Rest References (assumeValidRestReferences)",
  "options_flags_3_description" : "If the validator can't fetch target resources, it can at least be instructed validate that the target resource is correct. For instance, if the allowed target types are (Patient or RelatedPerson), and the reference is Group/12345, then this would be usually be an error. However this is not actually explicitly stated in the FHIR specification - a reference could be to http://some.server/somewhere - it doesn't need to look like a valid FHIR RESTful reference. In fact, it's not an error even if it happens to. So by default, the validator can assume nothing about the type of resource from the content of the reference itself. However most implementers do follow those rules - a reference to either Group/12345 or http://some-server/somwhere/Group/12345 is definitely to a Group resource. (and it's definitely recommended to follow these rules). The flag assumeValidRestReferences instructs the validator to use the type found in references that look like valid RESTful URLs when validating the type of the reference.",
  "options_flags_4_title" : "Extensible Binding Warnings (noExtensibleBindingWarnings)",
  "options_flags_4_description" : "When the validator encounters a code that is not part of an extensible binding, it adds a warning to suggest that the code be reviewed. The validator can't determine whether the meaning of the code makes it an inappropriate extension, or not; this requires human review. Hence, the warning. But the code may be valid - that's why extensible is defined - so in some operational uses of the validator, it is appropriate to turn these warnings off",
  "options_flags_5_title" : "Show Times (showTimes)",
  "options_flags_5_description" : "When selected the validator will produce a line in the output summarizing how long some internal processes took.",
  "options_flags_6_title" : "Allow Example URLs (allow-example-urls)",
  "options_flags_6_description" : "Some of the examples in the FHIR specification have URLs in them that refer to example.org. By default, the validator will always mark any such references as an error, but this can be overridden with this parameter.",
  "options_fhir_title" : "FHIR version",
  "options_default_label" : "Version",
  "options_fhir_description" : "The validator checks the resource against the base specification. By default, this is specification version 4.0.1.",
  "options_ig_title" : "Implementation Guides",
  "options_ig_description_1" : "Sie können anhand eines oder mehrerer veröffentlichter Implementierungsleitfäden validieren. Wählen Sie IGs über die Dropdown-Menüs unten aus und klicken Sie auf die Schaltfläche ",
  "options_ig_description_2" : "Hinzufügen",
  "options_ig_description_3" : " um sie in Ihre Validierung einzubeziehen.",
  "options_ig_dropdown" : "IG auswählen",
  "options_ig_dropdown_hint" : "Suche IGs...",
  "options_ig_version_dropdown_default" : "Keine kompatiblen Versionen",
  "options_ig_version_dropdown_hint" : "Wählen Sie die IG version",
  "options_ig_add" : "Hinzufügen",
  "options_ig_selected" : "Ausgewählte IGs",
  "options_ig_not_supported" : "IG nicht für FHIR Version unterstützt",
  "options_settings_title" : "Sonstige Einstellungen",
  "options_settings_snomed_title" : "Wählen Sie die SNOMED Version aus",
  "options_settings_snomed_description" : "Sie können angeben, welche Ausgabe von SNOMED CT der Terminologieserver bei der SNOMED CT-Validierung verwenden soll.",
  "options_settings_tm_title" : "Setze Terminologieserver",
  "options_settings_tm_description" : "Die Valdierungsengine verwendet einen Terminologieserver, um Codes aus großen externen Terminologien wie SNOMED CT, LOINC, RxNorm usw. zu validieren. Standardmäßig wird der Terminologieserver tx.fhir.org verwendet, der die meisten dieser Terminologien unterstützt. Wenn Sie einen anderen Terminologieserver verwenden möchten, können Sie ihn hier angeben. Als Warnung prüft der Server, ob das CapabilityStatement des angegebenen Servers korrekt eingestellt ist.",
  "options_settings_tm_verify" : "Überprüfen",
  "options_settings_tm_success" : "Terminologieserver erfolgreich validiert!",
  "options_settings_tm_error" : "Terminologieserver konnte nicht validiert werden!",
  "footer_running_version" : "Validator Version v",
  "footer_github" : "Projekt auf Github ansehen",
  "footer_create_issue" : "Issue erstellen",
  "footer_download_cli" : "download des neusten cli",
  "footer_doc" : "die Dokumentation des Validators anzeigen",
  "validation_results" : "Ergebnisse",
  "validation_fatals" : "Fatale Fehler",
  "validation_errors" : "Fehler",
  "validation_warnings" : "Warnungen",
  "validation_info" : "Information"
}