{
  "validate_heading" : "Validieren",
  "appscreen_validator_major" : "Ressourcen Validieren",
  "appscreen_validator_minor" : "Geben Sie Ressourcen manuell ein oder laden Sie sie zur Validierung hoch.",
  "enter_resources_heading" : "Ressource eintragen",
  "manual_entry_place_holder" : "Ressource manuell eintragen...",
  "manual_entry_title" : "Code",
  "manual_entry_empty_request_error" : "Bitte geben Sie etwas zum Validieren an.",
  "manual_entry_cannot_parse_exception" : "Der eingegebene Text kann nicht als gültiges JSON/XML geparst werden.",
  "manual_entry_validation_response_exception" : "Error received from validation server: %{httpResponseCode}-German",
  "manual_entry_timeout_exception" : "Validation timed out. Please wait 30 seconds and try again. -German",
  "validate_button" : "Validieren",
  "upload_resources_heading" : "Ressourcen Hochladen",
  "upload_files_title" : "Hochgeladene Dateien",
  "upload_button" : "Hochladen",
  "upload_entry_view" : "Ansicht",
  "upload_entry_delete" : "Löschen",
  "options_heading" : "Optionen",
  "appscreen_options_major" : "Validierungs Optionen",
  "appscreen_options_minor" : "Ändern Sie die Einstellung für die Validierung von Ressourcen.",
  "options_flags_title" : "Flags",
  "options_flags_do_native_title" : "Native Validierung (doNative)",
  "options_flags_do_native_description" : "Standardmäßig validiert die Validierungs-Engine nur unter Verwendung der FHIR-Strukturen und Profile. Die Publikationsprozesse erzeugen auch eine Vielzahl von xml, json und RDF-Schemata. Sie können den Validator bitten, auch gegen diese zu validieren, indem Sie diese Option verwenden. Beachten Sie, dass es in diesen Schemata nichts gibt, was nicht ohnehin direkt von der Engine selbst validiert wird, so dass der Hauptnutzen dieser Option darin besteht, die Art von Fehlern zu sehen, die aus diesen Schemata von anderer Software gemeldet werden würden.",
  "options_flags_must_support_title" : "Must Support (hintAboutMustSupport)",
  "options_flags_must_support_description" : "In einigen Fällen (z. B. bei der Erstellung von Beispielen für Implementierungsleitfäden oder bei der Prüfung auf potenzielle Interoperabilitätsprobleme mit einem neuen Kommunikationspartner) kann es nützlich sein, zu wissen, wann Datenelemente in einer Instanz vorhanden sind, die in dem/den Profil(en), gegen das/die die Instanz validiert wird, nicht \"mustSupport\" sind. Das Erkennen von Situationen, in denen dies der Fall ist, könnte eine Änderung des Profils bewirken oder einen Designer dazu veranlassen, ein Element aus der Instanz zu entfernen. In anderen Fällen kann das Vorhandensein des Elements in Ordnung sein und die Informationsmeldung ignoriert werden.",
  "options_flags_valid_reference_title" : "Gültige REST Referenzen annehmen (assumeValidRestReferences)",
  "options_flags_valid_reference_description" : "Wenn der Validator die Zielressourcen nicht abrufen kann, kann er zumindest angewiesen werden, zu überprüfen, ob die Zielressource korrekt ist. Wenn zum Beispiel die erlaubten Zieltypen (Patient oder RelatedPerson) sind und die Referenz Group/12345 lautet, dann wäre dies normalerweise ein Fehler. Dies ist jedoch nicht explizit in der FHIR-Spezifikation festgelegt - eine Referenz könnte auf http://some.server/somewhere lauten - sie muss nicht wie eine gültige FHIR RESTful-Referenz aussehen. Tatsächlich ist es kein Fehler, auch wenn es zufällig so ist. Standardmäßig kann der Validator also nichts über den Typ der Ressource aus dem Inhalt der Referenz selbst schließen. Die meisten Implementierer halten sich jedoch an diese Regeln - ein Verweis auf Group/12345 oder http://some-server/somwhere/Group/12345 bezieht sich definitiv auf eine Group-Ressource. (und es wird definitiv empfohlen, diese Regeln zu befolgen). Das Flag assumeValidRestReferences weist den Validator an, den Typ zu verwenden, der in Referenzen gefunden wird, die wie gültige RESTful-URLs aussehen, wenn der Typ der Referenz validiert wird.",
  "options_flags_binding_warnings_title" : "Extensible Binding Warnings (noExtensibleBindingWarnings)",
  "options_flags_binding_warnings_description" : "Wenn der Validator auf einen Code stößt, der nicht Teil eines extensible Bindings ist, fügt er eine Warnung hinzu, um vorzuschlagen, dass der Code überprüft werden sollte. Der Validator kann nicht feststellen, ob die Bedeutung des Codes ihn zu einer unangemessenen Erweiterung macht oder nicht; dies erfordert eine menschliche Überprüfung. Daher auch die Warnung. Aber der Code kann gültig sein - deshalb ist extensible definiert - also ist es in einigen Anwendungen des Validators angebracht, diese Warnungen auszuschalten.",
  "options_flags_show_times_title" : "Show Times (showTimes)",
  "options_flags_show_times_description" : "Wenn Sie diese Option wählen, gibt der Validator in der Ausgabe eine Zeile aus, in der er zusammenfasst, wie lange einige interne Prozesse gedauert haben.",
  "options_flags_allow_example_title" : "Erlaube Beispiel URLs (-allow-example-urls)",
  "options_flags_allow_example_description" : "Einige der Beispiele in der FHIR-Spezifikation enthalten URLs, die auf example.org verweisen. Standardmäßig markiert der Validator solche Verweise immer als Fehler, aber dies kann mit diesem Parameter überschrieben werden.",
  "options_flags_check_ips_codes_title" : "Check IPS Codes (-check-ips-codes) -German",
  "options_flags_check_ips_codes_description" : "When selected, the validator will report a list of SNOMED CT codes used by the source(s) being validated that are not part of the SNOMED CT IPS free set (as hints). -German",
  "options_fhir_title" : "FHIR version",
  "options_default_label" : "Version",
  "options_fhir_description" : "Der Validator prüft die Ressource anhand der Basisspezifikation. Standardmäßig ist dies die Spezifikation Version 4.0.1.",
  "options_ig_title" : "Implementation Guides",
  "options_ig_description_1" : "Sie können anhand eines oder mehrerer veröffentlichter Implementierungsleitfäden validieren. Wählen Sie IGs über die Dropdown-Menüs unten aus und klicken Sie auf die Schaltfläche ",
  "options_ig_description_2" : "Hinzufügen",
  "options_ig_description_3" : " um sie in Ihre Validierung einzubeziehen.",
  "options_ig_dropdown" : "IG auswählen",
  "options_ig_dropdown_hint" : "Suche IGs...",
  "options_ig_version_dropdown_default" : "Keine kompatiblen Versionen",
  "options_ig_version_dropdown_hint" : "Wählen Sie die IG version",
  "options_ig_add" : "Hinzufügen",
  "options_ig_not_selected" : "Ausgewählte IGs (%{selectedIgs})",
  "options_ig_selected" : "Ausgewählte IGs (%{selectedIgs}):",
  "options_ig_not_supported" : "IG nicht für FHIR Version unterstützt",
  "options_extensions_title" : "Extensions-German",
  "options_extensions_description" : "Controls how extensions are validated by the validator. Values for option are URLs for domains from which extensions will be allowed. By default, unknown extensions are prohibited, but can be allowed by selecting the 'Allow Any Extensions' checkbox.-German",
  "options_extensions_checkbox" : "Allow Any Extensions-German",
  "options_extensions_not_added" : "Added Extensions (%{addedExtensions})-German",
  "options_extensions_added" : "Added Extensions (%{addedExtensions}):-German",
  "options_profiles_title" : "Profiles-German",
  "options_profiles_description" : "The canonical URLs for the profiles you wish to validate against. These are usually clearly specified on the page where the profile is published.-German",
  "options_profiles_not_added" : "Added Profiles (%{addedProfiles})-German",
  "options_profiles_added" : "Added Profiles (%{addedProfiles}):-German",
  "options_bundle_validation_rules_title" : "Bundle Validation-German",
  "options_bundle_validation_rules_description" : "The validator can validate a particular resource in the bundle against a given profile. This is separate fro m the '-profile' option, which is the profile for the bundle itself. Each entry consists of a rule definition and a profile. The rule is defined as a resource name, an integer index, or both. Rule examples:-German",
  "options_bundle_validation_rules_example_1" : "Patient - validate any patient against the nominated profile-German",
  "options_bundle_validation_rules_example_2" : "0 - validate the first resource (index is 0 based) against the nominated profile-German",
  "options_bundle_validation_rules_example_3" : "Patient:0 - validate the first patient resource against the nominated profile-German",
  "options_bundle_validation_rules_not_added" : "Added Rules (%{addedProfiles})-German",
  "options_bundle_validation_rules_added" : "Added Rules (%{addedProfiles}):-German",
  "options_bundle_validation_rules_rule_label" : "Rule-German",
  "options_bundle_validation_rules_rule_description" : "A Resource name, an integer index, or both.-German",
  "options_bundle_validation_rules_profile_label" : "Profile-German",
  "options_bundle_validation_rules_profile_description" : "The nominated profile, by canonical URL-German",
  "options_settings_title" : "Sonstige Einstellungen",
  "options_settings_snomed_title" : "Wählen Sie die SNOMED Version aus",
  "options_settings_snomed_description" : "Sie können angeben, welche Ausgabe von SNOMED CT der Terminologieserver bei der SNOMED CT-Validierung verwenden soll.",
  "options_settings_tm_title" : "Setze Terminologieserver",
  "options_settings_tm_description" : "Die Valdierungsengine verwendet einen Terminologieserver, um Codes aus großen externen Terminologien wie SNOMED CT, LOINC, RxNorm usw. zu validieren. Standardmäßig wird der Terminologieserver tx.fhir.org verwendet, der die meisten dieser Terminologien unterstützt. Wenn Sie einen anderen Terminologieserver verwenden möchten, können Sie ihn hier angeben. Als Warnung prüft der Server, ob das CapabilityStatement des angegebenen Servers korrekt eingestellt ist.",
  "options_settings_tm_verify" : "Überprüfen",
  "options_settings_tm_success" : "Terminologieserver erfolgreich validiert!",
  "options_settings_tm_error" : "Terminologieserver konnte nicht validiert werden!",
  "footer_running_version" : "Validator Version v",
  "footer_github" : "Projekt auf Github ansehen",
  "footer_create_issue" : "Issue erstellen",
  "footer_download_cli" : "download des neusten cli",
  "footer_doc" : "die Dokumentation des Validators anzeigen",
  "footer_openapi" : "die Dokumentation des OpenAPI anzeigen",
  "validation_results" : "Ergebnisse",
  "validation_fatals" : "Fatale Fehler",
  "validation_errors" : "Fehler",
  "validation_warnings" : "Warnungen",
  "validation_info" : "Information",
  "preset_label" : "Common Validation Options... -German",
  "preset_description" : "Click to automatically set options for common validation tasks-German",
  "preset_notification" : "Set to validate using %{selectedPreset}. Select the Options tab for more settings. -German",
  "preset_fhir_resource" : "FHIR Resource -German",
  "preset_ips" : "IPS Document -German",
  "preset_ips_au" : "Australian IPS Document -German",
  "present_cda" : "CDA Document -German",
  "preset_us_ccda" : "US CCDA Document -German",
  "preset_sql_view": "SQL View Definition -German",
  "language" : "Sprache"
}