{
    "validate_heading": "Validar",
    "appscreen_validator_major": "Validar Recursos",
    "appscreen_validator_minor": "Ingresar manualmente, o cargar recursos para validación.",
    "enter_resources_heading": "Ingrese el Recurso",
    "manual_entry_place_holder": "Ingrese el recurso manualmente...",
    "manual_entry_title": "Código",
    "manual_entry_error": "Por favor ingrese algo para validar.",
    "manual_entry_cannot_parse_exception": "No se pudo analizar el texto ingresado como JSON o XML.",
    "validate_button": "Validar",
    "upload_resources_heading": "Cargar Recursos",
    "upload_files_title": "Cargar Archivos",
    "upload_button": "Cargar",
    "upload_entry_view": "Visualizar",
    "upload_entry_delete": "Borrar",
    "options_heading": "Opciones",
    "appscreen_options_major": "Opciones de Validación",
    "appscreen_options_minor": "Modificar configuración para validar recursos.",
    "options_flags_title": "Alarmas",
    "options_flags_do_native_title": "Validación Nativa (doNative)",
    "options_flags_do_native_description": "Por omisión, el motor de validación solo valida usando las estructuras y perfiles FHIR. Los procesos de publicación también generan una variedad de esquemas xml, json y RDF schemas. Puede pedirle al validador que valide también contra ellos usando esta opción. Note que no hay nada en estos esquemas que no sea validado directamente por el motor de todas maneras,asi que el uso principal para esto es ver el tipo de errores que serán reportados desde estos esquemas por otro software.",
    "options_flags_must_support_title": "Must-Support (hintAboutMustSupport)",
    "options_flags_must_support_description": "En algunos casos (por ejemplo cuando se crean ejemplos para guias de implementación o verificando problemas de interoperabilidad con un nuevo socio en la comunicación), puede ser útil saber cuando los elementos de datos están presentes en una instancia cuando los elementos no son \"mustSupport\" en el perfil contra el cual se valida la instancia. Identificar en que situaciones esto ocurre puede llevar a un cambio en el perfil o causar  que el diseñador elimine un elemento de la instancia. En otros casos, la presencia del elemento es adecuada y se puede ignorar el mensaje informativo.",
    "options_flags_valid_reference_title": "Asumir Referencias REST Válidas (assumeValidRestReferences)",
    "options_flags_valid_reference_description": "Si el validador no puede recuperar los recursos destino, se le puede indicar que verifique que al menos son válidos. Ejemplo: si los tipos de destino son (Patient o RelatedPerson), y la referencia es Group/12345, esto deberia ser un error. Sin embargo esto no es explícito en la especificación FHIR - la referencia podría ser a http://some.server/somewhere - no necesita ser una referencia válida RESTful FHIR. De hecho, no es un error si eso ocurre. Por omisión el validador no puede asumir nada sobre el tipo de recurso a partir de la referencia. Sin embargo, muchos implementadores siguen estas reglas: una referencia a Group/12345 o  http://some-server/somwhere/Group/12345 es a un recurso FHIR Group. (y se recomienda seguir estas reglas). La bandera assumeValidRestReferences instruye al validador que use el tipo encontrado en las referencias que parecen URLs RESTful validas cuando verifican el tipo de la referencia.",
    "options_flags_binding_warnings_title": "Alarmas sobre Vinculos Extensibles (noExtensibleBindingWarnings)",
    "options_flags_binding_warnings_description": "Cuando el validador encuentra un código que no es parte de una vinculacíon terminológica extensible, agrega una alerta para sugerir que el código sea revisado. El validador no puede determinar si el significado del código genera una extensión inapropiada o no; esto requiere revisión manual. De allí proviene la alerta - Pero el código puede ser válido - para eso se define como extensible - asi que en algunos usos operacionales del validador, es correcto apagar algunos de estas alertas",
    "options_flags_show_times_title": "Mostrar Tiempos (-show-times)",
    "options_flags_show_times_description": "Cuando se selecciona esta opción el validador generará una linea en la salida resumiendo cuanto tiempo demoran los procesos internos",
    "options_flags_allow_example_title": "Permitir URLs de ejemplo (allow-example-urls)",
    "options_flags_allow_example_description": "Alguno de los ejemplos en la especificación FHIR tienen URLs que apuntan a example.org. Por omisión, el validador las marcará como un error pero esta conducta puede ser modificado a través de este parámetro",
    "options_fhir_title": "Versión de FHIR",
    "options_default_label": "Version",
    "options_fhir_description": "El validador verifica el recurso contra la especificación base. Por omisión, esta es la especificación versión 4.0.1",
    "options_ig_title": "Guías de Implementación",
    "options_ig_description_1": "Puede validar contra una o más guías de implementación publicadas. Elija las guías usando el menú y haga click en el botón",
    "options_ig_description_2": "Agregar",
    "options_ig_description_3": " para incluirlas en su validación",
    "options_ig_dropdown": "Seleccionar Guía",
    "options_ig_dropdown_hint": "Buscar Guías...",
    "options_ig_version_dropdown_default": "No hay versiones compatibles",
    "options_ig_version_dropdown_hint": "Elija la versión de la guía",
    "options_ig_add": "Agregar",
    "options_ig_not_selected": "Guías Seleccionadas (%{selectedIgs})",
    "options_ig_selected": "Guías Seleccionadas (%{selectedIgs}):",
    "options_ig_not_supported": "Guía no soportada para la versión de FHIR",
    "options_extensions_title": "Extensiones",
    "options_extensions_description": "Controla como se validan las extensiones. Los valores para Values para la opción son URLs para dominios desde las cuales se permiten las extensiones. Por omisión, las extensiones desconocidas están prohibidas, pero pueden ser permitidas seleccionando 'Allow Any Extensions'",
    "options_extensions_checkbox": "Permitir cualquier extensión",
    "options_extensions_not_added": "Extensiones Agregadas (%{addedExtensions})",
    "options_extensions_added": "Extensiones Agregadas (%{addedExtensions}):",
    "options_settings_title": "Otras configuraciones",
    "options_profiles_title" : "Profiles-Spanish",
    "options_profiles_description" : "The canonical URLs for the profiles you wish to validate against. These are usually clearly specified on the page where the profile is published.-Spanish",
    "options_profiles_not_added" : "Added Profiles (%{addedProfiles})-Spanish",
    "options_profiles_added" : "Added Profiles (%{addedProfiles}):-Spanish",
    "options_settings_snomed_title": "Elegir versión de SNOMED",
    "options_settings_snomed_description": "Puede especificar qué edición de SNOMED CT utilizará para el servidor terminológico cuando valida SNOMED CT",
    "options_settings_tm_title": "Definir Servidor de Terminología",
    "options_settings_tm_description": "El motor de validación usa un servidor de terminologías para validar códigos de terminologías externas como SNOMED CT, LOINC y RxNorm. Por omisión, el servidor terminológico es tx.fhir.org, que soporta muchas de estas terminologías.Si quiere usar otro servidor terminológico, puede especificar uno aquí. Recuerde que el motor validará que el CapabilityStatement del server configurado sea el esperado.",
    "options_settings_tm_verify": "Verificar",
    "options_settings_tm_success": "El servidor de Terminología ha sido validado exitosamente!",
    "options_settings_tm_error": "El servidor de Terminología no ha podido ser validado!",
    "footer_running_version": "corriendo validador v",
    "footer_github": "ver proyecto en github",
    "footer_create_issue": "registrar un problema con el equipo",
    "footer_download_cli": "descargar la ultima versión de linea de comandos",
    "footer_doc": "ver la documentación del validador",
    "footer_openapi" : "ver la documentación del OpenAPI",
    "validation_results": "Resultados",
    "validation_fatals": "Fatales",
    "validation_errors": "Errores",
    "validation_warnings": "Alertas",
    "validation_info": "Información",
    "preset_label" : "Quick Settings -Spanish",
    "preset_notification" : "Set to validate using %{selectedPreset}. Select the Options tab for more settings. -Spanish",
    "preset_fhir_resource" : "FHIR 4.0 Resource -Spanish",
    "preset_ips" : "IPS Document -Spanish",
    "preset_ips_au" : "Australian IPS Document -Spanish",
    "present_cda" : "CDA Document -Spanish",
    "preset_us_ccda" : "US CCDA Document -Spanish",
    "preset_sql_view": "SQL View Definition -Spanish",
    "language": "Lenguaje"
}